#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/f818b952-47c1-4fae-a1ab-182c6811fa49/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-SjA7KSkTPf4PJuPx

Waiting for the plan to start...

Terraform v0.13.5
Initializing plugins and modules...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-main-eel]
random_integer.cf_origin_id: Refreshing state... [id=81]
data.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]
data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E17S6AJYEWNV2I]
module.network.data.aws_vpc.main: Refreshing state... [id=vpc-018906cab60cf165b]
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-main-eel]
module.network.data.aws_security_group.data: Refreshing state... [id=sg-068812412c1f4bea9]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
data.aws_caller_identity.current: Refreshing state... [id=813318847992]
module.network.data.aws_security_group.app: Refreshing state... [id=sg-03895fdd9a15adf6e]
data.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]
module.network.data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]
data.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]
module.network.data.aws_subnet_ids.data: Refreshing state... [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet_ids.web: Refreshing state... [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet_ids.app: Refreshing state... [id=vpc-018906cab60cf165b]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/63ba05da714f1978]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0991f0a71e238ad11]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Refreshing state... [id=subnet-0077fd92d83bfff33]
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Refreshing state... [id=subnet-089c577af80110363]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Refreshing state... [id=subnet-048e25be105ae01d3]
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Refreshing state... [id=subnet-0896ff158c3ecdc53]
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Refreshing state... [id=subnet-0a663db91e3d61619]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Refreshing state... [id=subnet-0d0e52f2aabe9cd5d]
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/1551ae1e56885489/f5e936709b9478dd/e5dfa1ccf37aeee7]
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220608033025431000000002]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        account_id        = "813318847992"
        arn               = "arn:aws:budgets::813318847992:budget/startup-sample-monthly"
        budget_type       = "COST"
        cost_filters      = {
            "TagKeyValue" = "user:Project$Startup Sample"
        }
        id                = "813318847992:startup-sample-monthly"
        limit_amount      = "100.0"
        limit_unit        = "USD"
        name              = "startup-sample-monthly"
        time_period_end   = "2087-06-15_00:00"
      ~ time_period_start = "2022-06-01_12:00" -> (known after apply)
        time_unit         = "MONTHLY"

        cost_filter {
            name   = "TagKeyValue"
            values = [
                "user:Project$Startup Sample",
            ]
        }

        cost_types {
            include_credit             = true
            include_discount           = true
            include_other_subscription = true
            include_recurring          = true
            include_refund             = true
            include_subscription       = true
            include_support            = true
            include_tax                = true
            include_upfront            = true
            use_amortized              = false
            use_blended                = false
        }

        notification {
            comparison_operator        = "GREATER_THAN"
            notification_type          = "FORECASTED"
            subscriber_email_addresses = []
            subscriber_sns_topic_arns  = [
                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",
            ]
            threshold                  = 75
            threshold_type             = "PERCENTAGE"
        }
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
      ~ desired_count                      = 1 -> 2
        enable_ecs_managed_tags            = true
        enable_execute_command             = false
        health_check_grace_period_seconds  = 60
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"
        name                               = "sample-service"
        platform_version                   = "LATEST"
        propagate_tags                     = "TASK_DEFINITION"
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "Application" = "Startup Sample"
        }
        tags_all                           = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:138" -> (known after apply)
        wait_for_steady_state              = false

        capacity_provider_strategy {
            base              = 0
            capacity_provider = "FARGATE_SPOT"
            weight            = 100
        }

        deployment_circuit_breaker {
            enable   = false
            rollback = false
        }

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "sample-client-app"
            container_port   = 80
            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/63ba05da714f1978"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-0991f0a71e238ad11",
            ]
            subnets          = [
                "subnet-048e25be105ae01d3",
                "subnet-0896ff158c3ecdc53",
            ]
        }
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:138" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    cpu              = 512
                    environment      = [
                        {
                            name  = "AWS_REGION"
                            value = "ca-central-1"
                        },
                        {
                            name  = "DB_NAME"
                            value = "ssp-greetings"
                        },
                        {
                            name  = "bucketName"
                            value = "upload-bucket-main-eel"
                        },
                    ]
                    essential        = true
                  ~ image            = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:82ffa503add0d4390910dfcffcad966b8f70282c" -> "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:fa034cec3d75cbd0247c48098f53381ff2ae2fb9"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-create-group  = "true"
                            awslogs-group         = "/ecs/sample-app"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs"
                        }
                    }
                    memory           = 1024
                    mountPoints      = []
                    name             = "sample-client-app"
                    portMappings     = [
                        {
                            containerPort = 80
                            hostPort      = 80
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "512"
        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"
        family                   = "sample-app-task"
      ~ id                       = "sample-app-task" -> (known after apply)
        memory                   = "1024"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 138 -> (known after apply)
        skip_destroy             = false
        tags                     = {
            "Application" = "Startup Sample"
        }
        tags_all                 = {
            "Application" = "Startup Sample"
        }
        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  on budget.tf line 19, in resource "aws_budgets_budget" "cost":
  19:   cost_filters = {
  20:     TagKeyValue = "user:Project$Startup Sample"
  21:   }

Use the attribute "cost_filter" instead.

(and 3 more similar warnings elsewhere)


Warning: Deprecated Resource

  on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":
  31: data "aws_subnet_ids" "web" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.

(and 2 more similar warnings elsewhere)


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.16160000000000048/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-SjA7KSkTPf4PJuPx%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.13.5%0AInitializing plugins and modules...%0ARefreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-main-eel]%0Arandom_integer.cf_origin_id: Refreshing state... [id=81]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]%0Adata.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E17S6AJYEWNV2I]%0Amodule.network.data.aws_vpc.main: Refreshing state... [id=vpc-018906cab60cf165b]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-main-eel]%0Amodule.network.data.aws_security_group.data: Refreshing state... [id=sg-068812412c1f4bea9]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Adata.aws_caller_identity.current: Refreshing state... [id=813318847992]%0Amodule.network.data.aws_security_group.app: Refreshing state... [id=sg-03895fdd9a15adf6e]%0Adata.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]%0Amodule.network.data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]%0Amodule.network.data.aws_subnet_ids.data: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.web: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.app: Refreshing state... [id=vpc-018906cab60cf165b]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/63ba05da714f1978]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0991f0a71e238ad11]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Refreshing state... [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Refreshing state... [id=subnet-089c577af80110363]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Refreshing state... [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Refreshing state... [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Refreshing state... [id=subnet-0a663db91e3d61619]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Refreshing state... [id=subnet-0d0e52f2aabe9cd5d]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/1551ae1e56885489/f5e936709b9478dd/e5dfa1ccf37aeee7]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220608033025431000000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        account_id        = "813318847992"%0A        arn               = "arn:aws:budgets::813318847992:budget/startup-sample-monthly"%0A        budget_type       = "COST"%0A        cost_filters      = {%0A            "TagKeyValue" = "user:Project$Startup Sample"%0A        }%0A        id                = "813318847992:startup-sample-monthly"%0A        limit_amount      = "100.0"%0A        limit_unit        = "USD"%0A        name              = "startup-sample-monthly"%0A        time_period_end   = "2087-06-15_00:00"%0A      ~ time_period_start = "2022-06-01_12:00" -> (known after apply)%0A        time_unit         = "MONTHLY"%0A%0A        cost_filter {%0A            name   = "TagKeyValue"%0A            values = [%0A                "user:Project$Startup Sample",%0A            ]%0A        }%0A%0A        cost_types {%0A            include_credit             = true%0A            include_discount           = true%0A            include_other_subscription = true%0A            include_recurring          = true%0A            include_refund             = true%0A            include_subscription       = true%0A            include_support            = true%0A            include_tax                = true%0A            include_upfront            = true%0A            use_amortized              = false%0A            use_blended                = false%0A        }%0A%0A        notification {%0A            comparison_operator        = "GREATER_THAN"%0A            notification_type          = "FORECASTED"%0A            subscriber_email_addresses = []%0A            subscriber_sns_topic_arns  = [%0A                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",%0A            ]%0A            threshold                  = 75%0A            threshold_type             = "PERCENTAGE"%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"%0A        deployment_maximum_percent         = 200%0A        deployment_minimum_healthy_percent = 100%0A      ~ desired_count                      = 1 -> 2%0A        enable_ecs_managed_tags            = true%0A        enable_execute_command             = false%0A        health_check_grace_period_seconds  = 60%0A        iam_role                           = "aws-service-role"%0A        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        platform_version                   = "LATEST"%0A        propagate_tags                     = "TASK_DEFINITION"%0A        scheduling_strategy                = "REPLICA"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                           = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:138" -> (known after apply)%0A        wait_for_steady_state              = false%0A%0A        capacity_provider_strategy {%0A            base              = 0%0A            capacity_provider = "FARGATE_SPOT"%0A            weight            = 100%0A        }%0A%0A        deployment_circuit_breaker {%0A            enable   = false%0A            rollback = false%0A        }%0A%0A        deployment_controller {%0A            type = "ECS"%0A        }%0A%0A        load_balancer {%0A            container_name   = "sample-client-app"%0A            container_port   = 80%0A            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/63ba05da714f1978"%0A        }%0A%0A        network_configuration {%0A            assign_public_ip = false%0A            security_groups  = [%0A                "sg-0991f0a71e238ad11",%0A            ]%0A            subnets          = [%0A                "subnet-048e25be105ae01d3",%0A                "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:138" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                    cpu              = 512%0A                    environment      = [%0A                        {%0A                            name  = "AWS_REGION"%0A                            value = "ca-central-1"%0A                        },%0A                        {%0A                            name  = "DB_NAME"%0A                            value = "ssp-greetings"%0A                        },%0A                        {%0A                            name  = "bucketName"%0A                            value = "upload-bucket-main-eel"%0A                        },%0A                    ]%0A                    essential        = true%0A                  ~ image            = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:82ffa503add0d4390910dfcffcad966b8f70282c" -> "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:fa034cec3d75cbd0247c48098f53381ff2ae2fb9"%0A                    logConfiguration = {%0A                        logDriver = "awslogs"%0A                        options   = {%0A                            awslogs-create-group  = "true"%0A                            awslogs-group         = "/ecs/sample-app"%0A                            awslogs-region        = "ca-central-1"%0A                            awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                    memory           = 1024%0A                    mountPoints      = []%0A                    name             = "sample-client-app"%0A                    portMappings     = [%0A                        {%0A                            containerPort = 80%0A                            hostPort      = 80%0A                            protocol      = "tcp"%0A                        },%0A                    ]%0A                    volumesFrom      = []%0A                } # forces replacement,%0A            ]%0A        )%0A        cpu                      = "512"%0A        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"%0A        family                   = "sample-app-task"%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A        memory                   = "1024"%0A        network_mode             = "awsvpc"%0A        requires_compatibilities = [%0A            "FARGATE",%0A        ]%0A      ~ revision                 = 138 -> (known after apply)%0A        skip_destroy             = false%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                 = {%0A            "Application" = "Startup Sample"%0A        }%0A        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0AWarning: Argument is deprecated%0A%0A  on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A  19:   cost_filters = {%0A  20:     TagKeyValue = "user:Project$Startup Sample"%0A  21:   }%0A%0AUse the attribute "cost_filter" instead.%0A%0A(and 3 more similar warnings elsewhere)%0A%0A%0AWarning: Deprecated Resource%0A%0A  on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A  31: data "aws_subnet_ids" "web" {%0A%0AThe aws_subnet_ids data source has been deprecated and will be removed in a%0Afuture version. Use the aws_subnets data source instead.%0A%0A(and 2 more similar warnings elsewhere)%0A%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.16160000000000048/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-SjA7KSkTPf4PJuPx%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.13.5%0AInitializing plugins and modules...%0ARefreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-main-eel]%0Arandom_integer.cf_origin_id: Refreshing state... [id=81]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]%0Adata.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E17S6AJYEWNV2I]%0Amodule.network.data.aws_vpc.main: Refreshing state... [id=vpc-018906cab60cf165b]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-main-eel]%0Amodule.network.data.aws_security_group.data: Refreshing state... [id=sg-068812412c1f4bea9]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Adata.aws_caller_identity.current: Refreshing state... [id=813318847992]%0Amodule.network.data.aws_security_group.app: Refreshing state... [id=sg-03895fdd9a15adf6e]%0Adata.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]%0Amodule.network.data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]%0Amodule.network.data.aws_subnet_ids.data: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.web: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.app: Refreshing state... [id=vpc-018906cab60cf165b]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/63ba05da714f1978]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0991f0a71e238ad11]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Refreshing state... [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Refreshing state... [id=subnet-089c577af80110363]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Refreshing state... [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Refreshing state... [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Refreshing state... [id=subnet-0a663db91e3d61619]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Refreshing state... [id=subnet-0d0e52f2aabe9cd5d]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/1551ae1e56885489/f5e936709b9478dd/e5dfa1ccf37aeee7]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220608033025431000000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        account_id        = "813318847992"%0A        arn               = "arn:aws:budgets::813318847992:budget/startup-sample-monthly"%0A        budget_type       = "COST"%0A        cost_filters      = {%0A            "TagKeyValue" = "user:Project$Startup Sample"%0A        }%0A        id                = "813318847992:startup-sample-monthly"%0A        limit_amount      = "100.0"%0A        limit_unit        = "USD"%0A        name              = "startup-sample-monthly"%0A        time_period_end   = "2087-06-15_00:00"%0A      ~ time_period_start = "2022-06-01_12:00" -> (known after apply)%0A        time_unit         = "MONTHLY"%0A%0A        cost_filter {%0A            name   = "TagKeyValue"%0A            values = [%0A                "user:Project$Startup Sample",%0A            ]%0A        }%0A%0A        cost_types {%0A            include_credit             = true%0A            include_discount           = true%0A            include_other_subscription = true%0A            include_recurring          = true%0A            include_refund             = true%0A            include_subscription       = true%0A            include_support            = true%0A            include_tax                = true%0A            include_upfront            = true%0A            use_amortized              = false%0A            use_blended                = false%0A        }%0A%0A        notification {%0A            comparison_operator        = "GREATER_THAN"%0A            notification_type          = "FORECASTED"%0A            subscriber_email_addresses = []%0A            subscriber_sns_topic_arns  = [%0A                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",%0A            ]%0A            threshold                  = 75%0A            threshold_type             = "PERCENTAGE"%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"%0A        deployment_maximum_percent         = 200%0A        deployment_minimum_healthy_percent = 100%0A      ~ desired_count                      = 1 -> 2%0A        enable_ecs_managed_tags            = true%0A        enable_execute_command             = false%0A        health_check_grace_period_seconds  = 60%0A        iam_role                           = "aws-service-role"%0A        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        platform_version                   = "LATEST"%0A        propagate_tags                     = "TASK_DEFINITION"%0A        scheduling_strategy                = "REPLICA"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                           = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:138" -> (known after apply)%0A        wait_for_steady_state              = false%0A%0A        capacity_provider_strategy {%0A            base              = 0%0A            capacity_provider = "FARGATE_SPOT"%0A            weight            = 100%0A        }%0A%0A        deployment_circuit_breaker {%0A            enable   = false%0A            rollback = false%0A        }%0A%0A        deployment_controller {%0A            type = "ECS"%0A        }%0A%0A        load_balancer {%0A            container_name   = "sample-client-app"%0A            container_port   = 80%0A            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/63ba05da714f1978"%0A        }%0A%0A        network_configuration {%0A            assign_public_ip = false%0A            security_groups  = [%0A                "sg-0991f0a71e238ad11",%0A            ]%0A            subnets          = [%0A                "subnet-048e25be105ae01d3",%0A                "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:138" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                    cpu              = 512%0A                    environment      = [%0A                        {%0A                            name  = "AWS_REGION"%0A                            value = "ca-central-1"%0A                        },%0A                        {%0A                            name  = "DB_NAME"%0A                            value = "ssp-greetings"%0A                        },%0A                        {%0A                            name  = "bucketName"%0A                            value = "upload-bucket-main-eel"%0A                        },%0A                    ]%0A                    essential        = true%0A                  ~ image            = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:82ffa503add0d4390910dfcffcad966b8f70282c" -> "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:fa034cec3d75cbd0247c48098f53381ff2ae2fb9"%0A                    logConfiguration = {%0A                        logDriver = "awslogs"%0A                        options   = {%0A                            awslogs-create-group  = "true"%0A                            awslogs-group         = "/ecs/sample-app"%0A                            awslogs-region        = "ca-central-1"%0A                            awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                    memory           = 1024%0A                    mountPoints      = []%0A                    name             = "sample-client-app"%0A                    portMappings     = [%0A                        {%0A                            containerPort = 80%0A                            hostPort      = 80%0A                            protocol      = "tcp"%0A                        },%0A                    ]%0A                    volumesFrom      = []%0A                } # forces replacement,%0A            ]%0A        )%0A        cpu                      = "512"%0A        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"%0A        family                   = "sample-app-task"%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A        memory                   = "1024"%0A        network_mode             = "awsvpc"%0A        requires_compatibilities = [%0A            "FARGATE",%0A        ]%0A      ~ revision                 = 138 -> (known after apply)%0A        skip_destroy             = false%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                 = {%0A            "Application" = "Startup Sample"%0A        }%0A        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0AWarning: Argument is deprecated%0A%0A  on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A  19:   cost_filters = {%0A  20:     TagKeyValue = "user:Project$Startup Sample"%0A  21:   }%0A%0AUse the attribute "cost_filter" instead.%0A%0A(and 3 more similar warnings elsewhere)%0A%0A%0AWarning: Deprecated Resource%0A%0A  on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A  31: data "aws_subnet_ids" "web" {%0A%0AThe aws_subnet_ids data source has been deprecated and will be removed in a%0Afuture version. Use the aws_subnets data source instead.%0A%0A(and 2 more similar warnings elsewhere)%0A%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.16160000000000048/mo +$0.0%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

#### Architecture Diagram

![img](https://i.ibb.co/n37r0XV/inframap.png)

*Pusher:* @crochcunill, *Action:* [Terraform Plan: #118](https://github.com/bcgov/startup-sample-project-aws-containers/actions/runs/2478041814)